cmsis-svd/cmsis-svd/data/STMicro/STM32H73x.svd
        <register>
          <name>AFRH</name>
          <displayName>AFRH</displayName>
          <description>GPIO alternate function high
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFSEL8</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 8..15) These bits are written by
              software to configure alternate function
              I/Os</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL9</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 8..15) These bits are written by
              software to configure alternate function
              I/Os</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL10</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 8..15) These bits are written by
              software to configure alternate function
              I/Os</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL11</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 8..15) These bits are written by
              software to configure alternate function
              I/Os</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL12</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 8..15) These bits are written by
              software to configure alternate function
              I/Os</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL13</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 8..15) These bits are written by
              software to configure alternate function
              I/Os</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL14</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 8..15) These bits are written by
              software to configure alternate function
              I/Os</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL15</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 8..15) These bits are written by
              software to configure alternate function
              I/Os</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <baseAddress>0x58020400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC</name>
      <baseAddress>0x58020800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOD</name>
      <baseAddress>0x58020C00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOE</name>
      <baseAddress>0x58021000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOF</name>
      <baseAddress>0x58021400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOG</name>
      <baseAddress>0x58021800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOH</name>
      <baseAddress>0x58021C00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOJ</name>
      <baseAddress>0x58022400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOK</name>
      <baseAddress>0x58022800</baseAddress>
    </peripheral>
    <peripheral>
      <name>MDMA</name>
      <description>MDMA</description>
      <groupName>MDMA</groupName>
      <baseAddress>0x52000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MDMA</name>
        <description>MDMA Global interrupt</description>
        <value>122</value>
      </interrupt>
      <registers>
        <register>
          <name>MDMA_GISR0</name>
          <displayName>MDMA_GISR0</displayName>
          <description>MDMA Global Interrupt/Status
          Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GIF0</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF1</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF2</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF3</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF4</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF5</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF6</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF7</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF8</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF9</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF10</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF11</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF12</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF13</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF14</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF15</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C0ISR</name>
          <displayName>MDMA_C0ISR</displayName>
          <description>MDMA channel x interrupt/status
          register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEIF0</name>
              <description>Channel x transfer error interrupt flag
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCRy register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF0</name>
              <description>Channel x Channel Transfer Complete
              interrupt flag This bit is set by hardware. It is
              cleared by software writing 1 to the corresponding
              bit in the DMA_IFCRy register. CTC is set when the
              last block was transferred and the channel has been
              automatically disabled. CTC is also set when the
              channel is suspended, as a result of writing EN bit
              to 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRTIF0</name>
              <description>Channel x block repeat transfer complete
              interrupt flag This bit is set by hardware. It is
              cleared by software writing 1 to the corresponding
              bit in the DMA_IFCRy register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BTIF0</name>
              <description>Channel x block transfer complete
              interrupt flag This bit is set by hardware. It is
              cleared by software writing 1 to the corresponding
              bit in the DMA_IFCRy register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF0</name>
              <description>channel x buffer transfer
              complete</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRQA0</name>
              <description>channel x request active
              flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C0IFCR</name>
          <displayName>MDMA_C0IFCR</displayName>
          <description>MDMA channel x interrupt flag clear
          register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTEIF0</name>
              <description>Channel x clear transfer error interrupt
              flag Writing a 1 into this bit clears TEIFx in the
              MDMA_ISRy register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCTCIF0</name>
              <description>Clear Channel transfer complete
              interrupt flag for channel x Writing a 1 into this
              bit clears CTCIFx in the MDMA_ISRy
              register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CBRTIF0</name>
              <description>Channel x clear block repeat transfer
              complete interrupt flag Writing a 1 into this bit
              clears BRTIFx in the MDMA_ISRy register</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CBTIF0</name>
              <description>Channel x Clear block transfer complete
              interrupt flag Writing a 1 into this bit clears BTIFx
              in the MDMA_ISRy register</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLTCIF0</name>
              <description>CLear buffer Transfer Complete Interrupt
              Flag for channel x Writing a 1 into this bit clears
              TCIFx in the MDMA_ISRy register</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMA_C0ESR</name>
          <displayName>MDMA_C0ESR</displayName>
          <description>MDMA Channel x error status
          register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEA</name>
              <description>Transfer Error Address These bits are
              set and cleared by HW, in case of an MDMA data
              transfer error. It is used in conjunction with TED.
              This field indicates the 7 LSBits of the address
              which generated a transfer/access error. It may be
              used by SW to retrieve the failing address, by adding
              this value (truncated to the buffer transfer length
              size) to the current SAR/DAR value. Note: The SAR/DAR
              current value doesnt reflect this last address due to
              the FIFO management system. The SAR/DAR are only
              updated at the end of a (buffer) transfer (of TLEN+1
              bytes). Note: It is not set in case of a link data
              error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>TED</name>
              <description>Transfer Error Direction These bit is
              set and cleared by HW, in case of an MDMA data
              transfer error.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TELD</name>
              <description>Transfer Error Link Data These bit is
              set by HW, in case of a transfer error while reading
              the block link data structure. It is cleared by
              software writing 1 to the CTEIFx bit in the DMA_IFCRy
              register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEMD</name>
              <description>Transfer Error Mask Data These bit is
              set by HW, in case of a transfer error while writing
              the Mask Data. It is cleared by software writing 1 to
              the CTEIFx bit in the DMA_IFCRy
              register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASE</name>
              <description>Address/Size Error These bit is set by
              HW, when the programmed address is not aligned with
              the data size. TED will indicate whether the problem
              is on the source or destination. It is cleared by
              software writing 1 to the CTEIFx bit in the DMA_IFCRy
              register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSE</name>
              <description>Block Size Error These bit is set by HW,
              when the block size is not an integer multiple of the
              data size either for source or destination. TED will
              indicate whether the problem is on the source or
              destination. It is cleared by software writing 1 to
              the CTEIFx bit in the DMA_IFCRy
              register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
