cmsis-svd/cmsis-svd/data/STMicro/STM32H73x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WWDG1</name>
      <description>WWDG</description>
      <groupName>WWDG</groupName>
      <baseAddress>0x50003000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WWDG1</name>
        <description>Window Watchdog interrupt</description>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <fields>
            <field>
              <name>T</name>
              <description>7-bit counter (MSB to LSB) These bits
              contain the value of the watchdog counter. It is
              decremented every (4096 x 2WDGTB[1:0]) PCLK cycles. A
              reset is produced when it is decremented from 0x40 to
              0x3F (T6 becomes cleared).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>WDGA</name>
              <description>Activation bit This bit is set by
              software and only cleared by hardware after a reset.
              When WDGA=1, the watchdog can generate a
              reset.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <displayName>CFR</displayName>
          <description>Configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <fields>
            <field>
              <name>W</name>
              <description>7-bit window value These bits contain
              the window value to be compared to the
              downcounter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>WDGTB</name>
              <description>Timer base The time base of the
              prescaler can be modified as follows:</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EWI</name>
              <description>Early wakeup interrupt When set, an
              interrupt occurs whenever the counter reaches the
              value 0x40. This interrupt is only cleared by
              hardware after a reset.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Status register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EWIF</name>
              <description>Early wakeup interrupt flag This bit is
              set by hardware when the counter has reached the
              value 0x40. It must be cleared by software by writing
              0. A write of 1 has no effect. This bit is also set
              if the interrupt is not enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>PWR</description>
      <groupName>PWR</groupName>
      <baseAddress>0x58024800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>PWR control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xF000C000</resetValue>
          <fields>
            <field>
              <name>LPDS</name>
              <description>Low-power Deepsleep with SVOS3 (SVOS4
              and SVOS5 always use low-power, regardless of the
              setting of this bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDE</name>
              <description>Programmable voltage detector
              enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLS</name>
              <description>Programmable voltage detector level
              selection These bits select the voltage threshold
              detected by the PVD. Note: Refer to Section
              Electrical characteristics of the product datasheet
              for more details.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DBP</name>
              <description>Disable backup domain write protection
              In reset state, the RCC_BDCR register, the RTC
              registers (including the backup registers), BREN and
              MOEN bits in PWR_CR2 register, are protected against
              parasitic write access. This bit must be set to
              enable write access to these registers.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLPS</name>
              <description>Flash low-power mode in DStop mode This
              bit allows to obtain the best trade-off between
              low-power consumption and restart time when exiting
              from DStop mode. When it is set, the Flash memory
              enters low-power mode when D1 domain is in DStop
              mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SVOS</name>
              <description>System Stop mode voltage scaling
              selection These bits control the VCORE voltage level
              in system Stop mode, to obtain the best trade-off
              between power consumption and
              performance.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AVDEN</name>
              <description>Peripheral voltage monitor on VDDA
              enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALS</name>
              <description>Analog voltage detector level selection
              These bits select the voltage threshold detected by
              the AVD.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR1</name>
          <displayName>CSR1</displayName>
          <description>PWR control status register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>PVDO</name>
              <description>Programmable voltage detect output This
              bit is set and cleared by hardware. It is valid only
              if the PVD has been enabled by the PVDE bit. Note:
              since the PVD is disabled in Standby mode, this bit
              is equal to 0 after Standby or reset until the PVDE
              bit is set.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTVOSRDY</name>
              <description>Voltage levels ready bit for currently
              used VOS and SDLEVEL This bit is set to 1 by hardware
              when the voltage regulator and the SD converter are
              both disabled and Bypass mode is selected in PWR
              control register 3 (PWR_CR3).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTVOS</name>
              <description>VOS currently applied for VCORE voltage
              scaling selection. These bits reflect the last VOS
              value applied to the PMU.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AVDO</name>
              <description>Analog voltage detector output on VDDA
              This bit is set and cleared by hardware. It is valid
              only if AVD on VDDA is enabled by the AVDEN bit.
              Note: Since the AVD is disabled in Standby mode, this
              bit is equal to 0 after Standby or reset until the
              AVDEN bit is set.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>This register is not reset by wakeup from
          Standby mode, RESET signal and VDD POR. It is only reset
          by VSW POR and VSWRST reset. This register shall not be
          accessed when VSWRST bit in RCC_BDCR register resets the
          VSW domain.After reset, PWR_CR2 register is
          write-protected. Prior to modifying its content, the DBP
          bit in PWR_CR1 register must be set to disable the write
          protection.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BREN</name>
              <description>Backup regulator enable When set, the
              Backup regulator (used to maintain the backup RAM
              content in Standby and VBAT modes) is enabled. If
              BREN is reset, the backup regulator is switched off.
              The backup RAM can still be used in Run and Stop
              modes. However, its content will be lost in Standby
              and VBAT modes. If BREN is set, the application must
              wait till the Backup Regulator Ready flag (BRRDY) is
              set to indicate that the data written into the SRAM
              will be maintained in Standby and VBAT
              modes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MONEN</name>
              <description>VBAT and temperature monitoring enable
              When set, the VBAT supply and temperature monitoring
              is enabled.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRRDY</name>
              <description>Backup regulator ready This bit is set
              by hardware to indicate that the Backup regulator is
              ready.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VBATL</name>
              <description>VBAT level monitoring versus low
              threshold</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VBATH</name>
              <description>VBAT level monitoring versus high
              threshold</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEMPL</name>
              <description>Temperature level monitoring versus low
              threshold</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEMPH</name>
              <description>Temperature level monitoring versus high
              threshold</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <displayName>CR3</displayName>
          <description>Reset only by POR only, not reset by wakeup
          from Standby mode and RESET pad. The lower byte of this
          register is written once after POR and shall be written
          before changing VOS level or ck_sys clock frequency. No
          limitation applies to the upper bytes.Programming data
          corresponding to an invalid combination of SDLEVEL,
          SDEXTHP, SDEN, LDOEN and BYPASS bits (see Table9) will be
          ignored: data will not be written, the written-once
          mechanism will lock the register and any further write
          access will be ignored. The default supply configuration
          will be kept and the ACTVOSRDY bit in PWR control status
          register 1 (PWR_CSR1) will go on indicating invalid
          voltage levels. The system shall be power cycled before
          writing a new value.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>Power management unit
              bypass</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDOEN</name>
              <description>Low drop-out regulator
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDEN</name>
              <description>SD converter Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBE</name>
              <description>VBAT charging enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBRS</name>
              <description>VBAT charging resistor
              selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB33DEN</name>
              <description>VDD33USB voltage level detector
              enable.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USBREGEN</name>
              <description>USB regulator enable.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB33RDY</name>
              <description>USB supply ready.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUCR</name>
          <displayName>CPUCR</displayName>
          <description>This register allows controlling CPU1
          power.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDDS_D1</name>
              <description>D1 domain Power Down Deepsleep
              selection. This bit allows CPU1 to define the
              Deepsleep mode for D1 domain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDDS_D2</name>
              <description>D2 domain Power Down Deepsleep. This bit
              allows CPU1 to define the Deepsleep mode for D2
              domain.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDDS_D3</name>
              <description>System D3 domain Power Down Deepsleep.
              This bit allows CPU1 to define the Deepsleep mode for
              System D3 domain.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOPF</name>
              <description>STOP flag This bit is set by hardware
              and cleared only by any reset or by setting the CPU1
              CSSF bit.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBF</name>
              <description>System Standby flag This bit is set by
              hardware and cleared only by a POR (Power-on Reset)
              or by setting the CPU1 CSSF bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBF_D1</name>
              <description>D1 domain DStandby flag This bit is set
              by hardware and cleared by any system reset or by
              setting the CPU1 CSSF bit. Once set, this bit can be
              cleared only when the D1 domain is no longer in
              DStandby mode.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBF_D2</name>
              <description>D2 domain DStandby flag This bit is set
              by hardware and cleared by any system reset or by
              setting the CPU1 CSSF bit. Once set, this bit can be
              cleared only when the D2 domain is no longer in
              DStandby mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSSF</name>
              <description>Clear D1 domain CPU1 Standby, Stop and
              HOLD flags (always read as 0) This bit is cleared to
              0 by hardware.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RUN_D3</name>
              <description>Keep system D3 domain in Run mode
              regardless of the CPU sub-systems modes</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D3CR</name>
          <displayName>D3CR</displayName>
          <description>This register allows controlling D3 domain
          power.Following reset VOSRDY will be read 1 by
          software</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>VOSRDY</name>
              <description>VOS Ready bit for VCORE voltage scaling
              output selection. This bit is set to 1 by hardware
              when Bypass mode is selected in PWR control register
              3 (PWR_CR3).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VOS</name>
              <description>Voltage scaling selection according to
              performance These bits control the VCORE voltage
              level and allow to obtains the best trade-off between
              power consumption and performance: When increasing
              the performance, the voltage scaling shall be changed
              before increasing the system frequency. When
              decreasing performance, the system frequency shall
              first be decreased before changing the voltage
              scaling.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUPCR</name>
          <displayName>WKUPCR</displayName>
          <description>reset only by system reset, not reset by
          wakeup from Standby mode5 wait states are required when
          writing this register (when clearing a WKUPF bit in
          PWR_WKUPFR, the AHB write access will complete after the
          WKUPF has been cleared).</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WKUPC</name>
              <description>Clear Wakeup pin flag for WKUP. These
              bits are always read as 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
