cmsis-svd/cmsis-svd/data/STMicro/STM32H73x.svd
        <register>
          <name>MMC_RX_INTERRUPT</name>
          <displayName>MMC_RX_INTERRUPT</displayName>
          <description>MMC Rx interrupt register</description>
          <addressOffset>0x704</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXCRCERPIS</name>
              <description>RXCRCERPIS</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXALGNERPIS</name>
              <description>RXALGNERPIS</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXUCGPIS</name>
              <description>RXUCGPIS</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXLPIUSCIS</name>
              <description>RXLPIUSCIS</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXLPITRCIS</name>
              <description>RXLPITRCIS</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMC_TX_INTERRUPT</name>
          <displayName>MMC_TX_INTERRUPT</displayName>
          <description>MMC Tx interrupt register</description>
          <addressOffset>0x708</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXSCOLGPIS</name>
              <description>TXSCOLGPIS</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXMCOLGPIS</name>
              <description>TXMCOLGPIS</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXGPKTIS</name>
              <description>TXGPKTIS</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXLPIUSCIS</name>
              <description>TXLPIUSCIS</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXLPITRCIS</name>
              <description>TXLPITRCIS</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMC_RX_INTERRUPT_MASK</name>
          <displayName>MMC_RX_INTERRUPT_MASK</displayName>
          <description>MMC Rx interrupt mask register</description>
          <addressOffset>0x70C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXCRCERPIM</name>
              <description>RXCRCERPIM</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXALGNERPIM</name>
              <description>RXALGNERPIM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXUCGPIM</name>
              <description>RXUCGPIM</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLPIUSCIM</name>
              <description>RXLPIUSCIM</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLPITRCIM</name>
              <description>RXLPITRCIM</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMC_TX_INTERRUPT_MASK</name>
          <displayName>MMC_TX_INTERRUPT_MASK</displayName>
          <description>MMC Tx interrupt mask register</description>
          <addressOffset>0x710</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXSCOLGPIM</name>
              <description>TXSCOLGPIM</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXMCOLGPIM</name>
              <description>TXMCOLGPIM</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXGPKTIM</name>
              <description>TXGPKTIM</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXLPIUSCIM</name>
              <description>TXLPIUSCIM</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXLPITRCIM</name>
              <description>TXLPITRCIM</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_SINGLE_COLLISION_GOOD_PACKETS</name>
          <displayName>
          TX_SINGLE_COLLISION_GOOD_PACKETS</displayName>
          <description>Tx single collision good packets
          register</description>
          <addressOffset>0x74C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXSNGLCOLG</name>
              <description>TXSNGLCOLG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_MULTIPLE_COLLISION_GOOD_PACKETS</name>
          <displayName>
          TX_MULTIPLE_COLLISION_GOOD_PACKETS</displayName>
          <description>Tx multiple collision good packets
          register</description>
          <addressOffset>0x750</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXMULTCOLG</name>
              <description>TXMULTCOLG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_PACKET_COUNT_GOOD</name>
          <displayName>TX_PACKET_COUNT_GOOD</displayName>
          <description>Tx packet count good register</description>
          <addressOffset>0x768</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXPKTG</name>
              <description>TXPKTG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CRC_ERROR_PACKETS</name>
          <displayName>RX_CRC_ERROR_PACKETS</displayName>
          <description>Rx CRC error packets register</description>
          <addressOffset>0x794</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXCRCERR</name>
              <description>RXCRCERR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ALIGNMENT_ERROR_PACKETS</name>
          <displayName>RX_ALIGNMENT_ERROR_PACKETS</displayName>
          <description>Rx alignment error packets
          register</description>
          <addressOffset>0x798</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXALGNERR</name>
              <description>RXALGNERR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_UNICAST_PACKETS_GOOD</name>
          <displayName>RX_UNICAST_PACKETS_GOOD</displayName>
          <description>Rx unicast packets good
          register</description>
          <addressOffset>0x7C4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXUCASTG</name>
              <description>RXUCASTG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_LPI_USEC_CNTR</name>
          <displayName>TX_LPI_USEC_CNTR</displayName>
          <description>Tx LPI microsecond timer
          register</description>
          <addressOffset>0x7EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXLPIUSC</name>
              <description>TXLPIUSC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_LPI_TRAN_CNTR</name>
          <displayName>TX_LPI_TRAN_CNTR</displayName>
          <description>Tx LPI transition counter
          register</description>
          <addressOffset>0x7F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXLPITRC</name>
              <description>TXLPITRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_LPI_USEC_CNTR</name>
          <displayName>RX_LPI_USEC_CNTR</displayName>
          <description>Rx LPI microsecond counter
          register</description>
          <addressOffset>0x7F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXLPIUSC</name>
              <description>RXLPIUSC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_LPI_TRAN_CNTR</name>
          <displayName>RX_LPI_TRAN_CNTR</displayName>
          <description>Rx LPI transition counter
          register</description>
          <addressOffset>0x7F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXLPITRC</name>
              <description>RXLPITRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3L4C0R</name>
          <displayName>MACL3L4C0R</displayName>
          <description>L3 and L4 control 0 register</description>
          <addressOffset>0x900</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>L3PEN0</name>
              <description>L3PEN0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3SAM0</name>
              <description>L3SAM0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3SAIM0</name>
              <description>L3SAIM0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3DAM0</name>
              <description>L3DAM0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3DAIM0</name>
              <description>L3DAIM0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3HSBM0</name>
              <description>L3HSBM0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>L3HDBM0</name>
              <description>L3HDBM0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>L4PEN0</name>
              <description>L4PEN0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4SPM0</name>
              <description>L4SPM0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4SPIM0</name>
              <description>L4SPIM0</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4DPM0</name>
              <description>L4DPM0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4DPIM0</name>
              <description>L4DPIM0</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL4A0R</name>
          <displayName>MACL4A0R</displayName>
          <description>Layer4 address filter 0
          register</description>
          <addressOffset>0x904</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>L4SP0</name>
              <description>L4SP0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>L4DP0</name>
              <description>L4DP0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACDR</name>
          <displayName>MACDR</displayName>
          <description>Debug register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RPESTS</name>
              <description>RPESTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFCFCSTS</name>
              <description>RFCFCSTS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TPESTS</name>
              <description>TPESTS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFCSTS</name>
              <description>TFCSTS</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3A00R</name>
          <displayName>MACL3A00R</displayName>
          <description>MACL3A00R</description>
          <addressOffset>0x910</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>L3A00</name>
              <description>L3A00</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3A10R</name>
          <displayName>MACL3A10R</displayName>
          <description>Layer3 address 1 filter 0
          register</description>
          <addressOffset>0x914</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>L3A10</name>
              <description>L3A10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3A20</name>
          <displayName>MACL3A20</displayName>
          <description>Layer3 Address 2 filter 0
          register</description>
          <addressOffset>0x918</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>L3A20</name>
              <description>L3A20</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3A30</name>
          <displayName>MACL3A30</displayName>
          <description>Layer3 Address 3 filter 0
          register</description>
          <addressOffset>0x91C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>L3A30</name>
              <description>L3A30</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3L4C1R</name>
          <displayName>MACL3L4C1R</displayName>
          <description>L3 and L4 control 1 register</description>
          <addressOffset>0x930</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>L3PEN1</name>
              <description>L3PEN1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3SAM1</name>
              <description>L3SAM1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3SAIM1</name>
              <description>L3SAIM1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3DAM1</name>
              <description>L3DAM1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3DAIM1</name>
              <description>L3DAIM1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3HSBM1</name>
              <description>L3HSBM1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>L3HDBM1</name>
              <description>L3HDBM1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>L4PEN1</name>
              <description>L4PEN1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4SPM1</name>
              <description>L4SPM1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4SPIM1</name>
              <description>L4SPIM1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4DPM1</name>
              <description>L4DPM1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4DPIM1</name>
              <description>L4DPIM1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL4A1R</name>
          <displayName>MACL4A1R</displayName>
          <description>Layer 4 address filter 1
          register</description>
          <addressOffset>0x934</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>L4SP1</name>
              <description>L4SP1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>L4DP1</name>
              <description>L4DP1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
